Revit 2027 API
LightGroupManager.SetLightGroupOn Method
 Turns the given light group on or off for rendering the given view depending on the bool argument
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetLightGroupOn(
	ElementId viewId,
	ElementId groupId,
	bool turnOn
)
Public Sub SetLightGroupOn (
	viewId As ElementId,
	groupId As ElementId,
	turnOn As Boolean
)
public:
void SetLightGroupOn(
	ElementId^ viewId,
	ElementId^ groupId,
	bool turnOn
)
member SetLightGroupOn :
        viewId : ElementId *
        groupId : ElementId *
        turnOn : bool -> unit
Parameters
viewId ElementId
 The Id of the view
groupId ElementId
 The Id of the light group
turnOn Boolean
 Turns the light group on if true, off if false
Exceptions
Exception | Condition
ArgumentException |  The given element Id does not correspond to a 3d view -or- The given element Id does not correspond to a light group
ArgumentNullException |  A non-optional argument was null
See Also
Reference
LightGroupManager Class
Autodesk.Revit.DB.Lighting Namespace